Autodesk.Revit.DB.BeamSystemTypeSet
A set that contains BeamSystem types.

Autodesk.Revit.DB.BeamSystemTypeSet.Insert(Autodesk.Revit.DB.Structure.BeamSystemType)
System.Int32
Insert the specified BeamSystem type into the set.
item: The BeamSystem type to be inserted into the set.
Returns: Returns whether the BeamSystem type was inserted into the set.

Autodesk.Revit.DB.BeamSystemTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.BeamSystemTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.BeamSystemTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.BeamSystemTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.BeamSystemTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.BeamSystemTypeSet.Erase(Autodesk.Revit.DB.Structure.BeamSystemType)
System.Int32
Removes a specified BeamSystem type from the set.
item: The BeamSystem type to be erased.
Returns: The number of BeamSystem types that were erased from the set.

Autodesk.Revit.DB.BeamSystemTypeSet.Contains(Autodesk.Revit.DB.Structure.BeamSystemType)
System.Boolean
Tests for the existence of a BeamSystem type within the set.
item: The BeamSystem type to be searched for.
Returns: The Contains method returns True if the BeamSystem type is within the set, otherwise False.

Autodesk.Revit.DB.BeamSystemTypeSet.Clear
void
Removes every BeamSystem type from the set, rendering it empty.

Autodesk.Revit.DB.BeamSystemTypeSet.Size
System.Int32
get
Returns the number of BeamSystem types that are in the set.

Autodesk.Revit.DB.BeamSystemTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.